----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]          36,864
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
 AdaptiveAvgPool2d-8             [-1, 64, 1, 1]               0
            Linear-9                    [-1, 4]             256
             ReLU-10                    [-1, 4]               0
           Linear-11                   [-1, 64]             256
          Sigmoid-12                   [-1, 64]               0
          SEBlock-13           [-1, 64, 56, 56]               0
           Conv2d-14           [-1, 64, 56, 56]          36,864
      BatchNorm2d-15           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-16             [-1, 64, 1, 1]               0
           Linear-17                    [-1, 4]             256
             ReLU-18                    [-1, 4]               0
           Linear-19                   [-1, 64]             256
          Sigmoid-20                   [-1, 64]               0
          SEBlock-21           [-1, 64, 56, 56]               0
             ReLU-22           [-1, 64, 56, 56]               0
  twoSEBasicBlock-23           [-1, 64, 56, 56]               0
           Conv2d-24           [-1, 64, 56, 56]          36,864
      BatchNorm2d-25           [-1, 64, 56, 56]             128
             ReLU-26           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-27             [-1, 64, 1, 1]               0
           Linear-28                    [-1, 4]             256
             ReLU-29                    [-1, 4]               0
           Linear-30                   [-1, 64]             256
          Sigmoid-31                   [-1, 64]               0
          SEBlock-32           [-1, 64, 56, 56]               0
           Conv2d-33           [-1, 64, 56, 56]          36,864
      BatchNorm2d-34           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-35             [-1, 64, 1, 1]               0
           Linear-36                    [-1, 4]             256
             ReLU-37                    [-1, 4]               0
           Linear-38                   [-1, 64]             256
          Sigmoid-39                   [-1, 64]               0
          SEBlock-40           [-1, 64, 56, 56]               0
             ReLU-41           [-1, 64, 56, 56]               0
  twoSEBasicBlock-42           [-1, 64, 56, 56]               0
           Conv2d-43          [-1, 128, 28, 28]          73,728
      BatchNorm2d-44          [-1, 128, 28, 28]             256
             ReLU-45          [-1, 128, 28, 28]               0
AdaptiveAvgPool2d-46            [-1, 128, 1, 1]               0
           Linear-47                    [-1, 8]           1,024
             ReLU-48                    [-1, 8]               0
           Linear-49                  [-1, 128]           1,024
          Sigmoid-50                  [-1, 128]               0
          SEBlock-51          [-1, 128, 28, 28]               0
           Conv2d-52          [-1, 128, 28, 28]         147,456
      BatchNorm2d-53          [-1, 128, 28, 28]             256
AdaptiveAvgPool2d-54            [-1, 128, 1, 1]               0
           Linear-55                    [-1, 8]           1,024
             ReLU-56                    [-1, 8]               0
           Linear-57                  [-1, 128]           1,024
          Sigmoid-58                  [-1, 128]               0
          SEBlock-59          [-1, 128, 28, 28]               0
           Conv2d-60          [-1, 128, 28, 28]           8,192
      BatchNorm2d-61          [-1, 128, 28, 28]             256
             ReLU-62          [-1, 128, 28, 28]               0
  twoSEBasicBlock-63          [-1, 128, 28, 28]               0
           Conv2d-64          [-1, 128, 28, 28]         147,456
      BatchNorm2d-65          [-1, 128, 28, 28]             256
             ReLU-66          [-1, 128, 28, 28]               0
AdaptiveAvgPool2d-67            [-1, 128, 1, 1]               0
           Linear-68                    [-1, 8]           1,024
             ReLU-69                    [-1, 8]               0
           Linear-70                  [-1, 128]           1,024
          Sigmoid-71                  [-1, 128]               0
          SEBlock-72          [-1, 128, 28, 28]               0
           Conv2d-73          [-1, 128, 28, 28]         147,456
      BatchNorm2d-74          [-1, 128, 28, 28]             256
AdaptiveAvgPool2d-75            [-1, 128, 1, 1]               0
           Linear-76                    [-1, 8]           1,024
             ReLU-77                    [-1, 8]               0
           Linear-78                  [-1, 128]           1,024
          Sigmoid-79                  [-1, 128]               0
          SEBlock-80          [-1, 128, 28, 28]               0
             ReLU-81          [-1, 128, 28, 28]               0
  twoSEBasicBlock-82          [-1, 128, 28, 28]               0
           Conv2d-83          [-1, 256, 14, 14]         294,912
      BatchNorm2d-84          [-1, 256, 14, 14]             512
             ReLU-85          [-1, 256, 14, 14]               0
AdaptiveAvgPool2d-86            [-1, 256, 1, 1]               0
           Linear-87                   [-1, 16]           4,096
             ReLU-88                   [-1, 16]               0
           Linear-89                  [-1, 256]           4,096
          Sigmoid-90                  [-1, 256]               0
          SEBlock-91          [-1, 256, 14, 14]               0
           Conv2d-92          [-1, 256, 14, 14]         589,824
      BatchNorm2d-93          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-94            [-1, 256, 1, 1]               0
           Linear-95                   [-1, 16]           4,096
             ReLU-96                   [-1, 16]               0
           Linear-97                  [-1, 256]           4,096
          Sigmoid-98                  [-1, 256]               0
          SEBlock-99          [-1, 256, 14, 14]               0
          Conv2d-100          [-1, 256, 14, 14]          32,768
     BatchNorm2d-101          [-1, 256, 14, 14]             512
            ReLU-102          [-1, 256, 14, 14]               0
 twoSEBasicBlock-103          [-1, 256, 14, 14]               0
          Conv2d-104          [-1, 256, 14, 14]         589,824
     BatchNorm2d-105          [-1, 256, 14, 14]             512
            ReLU-106          [-1, 256, 14, 14]               0
AdaptiveAvgPool2d-107            [-1, 256, 1, 1]               0
          Linear-108                   [-1, 16]           4,096
            ReLU-109                   [-1, 16]               0
          Linear-110                  [-1, 256]           4,096
         Sigmoid-111                  [-1, 256]               0
         SEBlock-112          [-1, 256, 14, 14]               0
          Conv2d-113          [-1, 256, 14, 14]         589,824
     BatchNorm2d-114          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-115            [-1, 256, 1, 1]               0
          Linear-116                   [-1, 16]           4,096
            ReLU-117                   [-1, 16]               0
          Linear-118                  [-1, 256]           4,096
         Sigmoid-119                  [-1, 256]               0
         SEBlock-120          [-1, 256, 14, 14]               0
            ReLU-121          [-1, 256, 14, 14]               0
 twoSEBasicBlock-122          [-1, 256, 14, 14]               0
          Conv2d-123            [-1, 512, 7, 7]       1,179,648
     BatchNorm2d-124            [-1, 512, 7, 7]           1,024
            ReLU-125            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-126            [-1, 512, 1, 1]               0
          Linear-127                   [-1, 32]          16,384
            ReLU-128                   [-1, 32]               0
          Linear-129                  [-1, 512]          16,384
         Sigmoid-130                  [-1, 512]               0
         SEBlock-131            [-1, 512, 7, 7]               0
          Conv2d-132            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-133            [-1, 512, 7, 7]           1,024
AdaptiveAvgPool2d-134            [-1, 512, 1, 1]               0
          Linear-135                   [-1, 32]          16,384
            ReLU-136                   [-1, 32]               0
          Linear-137                  [-1, 512]          16,384
         Sigmoid-138                  [-1, 512]               0
         SEBlock-139            [-1, 512, 7, 7]               0
          Conv2d-140            [-1, 512, 7, 7]         131,072
     BatchNorm2d-141            [-1, 512, 7, 7]           1,024
            ReLU-142            [-1, 512, 7, 7]               0
 twoSEBasicBlock-143            [-1, 512, 7, 7]               0
          Conv2d-144            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-145            [-1, 512, 7, 7]           1,024
            ReLU-146            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-147            [-1, 512, 1, 1]               0
          Linear-148                   [-1, 32]          16,384
            ReLU-149                   [-1, 32]               0
          Linear-150                  [-1, 512]          16,384
         Sigmoid-151                  [-1, 512]               0
         SEBlock-152            [-1, 512, 7, 7]               0
          Conv2d-153            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-154            [-1, 512, 7, 7]           1,024
AdaptiveAvgPool2d-155            [-1, 512, 1, 1]               0
          Linear-156                   [-1, 32]          16,384
            ReLU-157                   [-1, 32]               0
          Linear-158                  [-1, 512]          16,384
         Sigmoid-159                  [-1, 512]               0
         SEBlock-160            [-1, 512, 7, 7]               0
            ReLU-161            [-1, 512, 7, 7]               0
 twoSEBasicBlock-162            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-163            [-1, 512, 1, 1]               0
          Linear-164                 [-1, 1000]         513,000
================================================================
Total params: 11,863,592
Trainable params: 11,863,592
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 74.37
Params size (MB): 45.26
Estimated Total Size (MB): 120.20
----------------------------------------------------------------
#Params: 11.9M
21:15:35 --- Start training loop	training on: cuda
21:16:28 --- Epoch: 1	Train loss: 1.7609	Valid loss: 1.4575	Train accuracy: 44.78	Valid accuracy: 46.91
21:17:21 --- Epoch: 2	Train loss: 1.3117	Valid loss: 1.3190	Train accuracy: 53.16	Valid accuracy: 54.99
21:18:18 --- Epoch: 3	Train loss: 1.1465	Valid loss: 1.1651	Train accuracy: 58.78	Valid accuracy: 60.07
21:19:17 --- Epoch: 4	Train loss: 1.0523	Valid loss: 1.0854	Train accuracy: 61.19	Valid accuracy: 61.43
21:20:10 --- Epoch: 5	Train loss: 0.9691	Valid loss: 1.0172	Train accuracy: 63.66	Valid accuracy: 65.27
21:21:03 --- Epoch: 6	Train loss: 0.9252	Valid loss: 1.0139	Train accuracy: 64.88	Valid accuracy: 65.77
21:21:57 --- Epoch: 7	Train loss: 0.8777	Valid loss: 0.9047	Train accuracy: 68.34	Valid accuracy: 68.16
21:22:51 --- Epoch: 8	Train loss: 0.8451	Valid loss: 0.9223	Train accuracy: 66.17	Valid accuracy: 68.67
21:23:44 --- Epoch: 9	Train loss: 0.8219	Valid loss: 0.8575	Train accuracy: 70.59	Valid accuracy: 71.05
21:24:38 --- Epoch: 10	Train loss: 0.8029	Valid loss: 0.8610	Train accuracy: 70.68	Valid accuracy: 71.65
21:25:30 --- Epoch: 11	Train loss: 0.7877	Valid loss: 0.8671	Train accuracy: 70.10	Valid accuracy: 70.23
21:26:23 --- Epoch: 12	Train loss: 0.7784	Valid loss: 0.8060	Train accuracy: 72.67	Valid accuracy: 73.16
21:27:16 --- Epoch: 13	Train loss: 0.7598	Valid loss: 0.7466	Train accuracy: 73.97	Valid accuracy: 74.28
21:28:09 --- Epoch: 14	Train loss: 0.7486	Valid loss: 0.8694	Train accuracy: 71.05	Valid accuracy: 71.06
21:29:01 --- Epoch: 15	Train loss: 0.7403	Valid loss: 0.7830	Train accuracy: 73.81	Valid accuracy: 73.75
21:29:54 --- Epoch: 16	Train loss: 0.7380	Valid loss: 0.7103	Train accuracy: 75.63	Valid accuracy: 76.14
21:30:47 --- Epoch: 17	Train loss: 0.7291	Valid loss: 0.7927	Train accuracy: 73.14	Valid accuracy: 72.83
21:31:40 --- Epoch: 18	Train loss: 0.7235	Valid loss: 0.8203	Train accuracy: 72.64	Valid accuracy: 73.14
21:32:33 --- Epoch: 19	Train loss: 0.7211	Valid loss: 0.8291	Train accuracy: 71.81	Valid accuracy: 71.53
21:33:26 --- Epoch: 20	Train loss: 0.7125	Valid loss: 0.7440	Train accuracy: 74.45	Valid accuracy: 74.82
21:34:19 --- Epoch: 21	Train loss: 0.7077	Valid loss: 0.7870	Train accuracy: 73.41	Valid accuracy: 73.15
21:35:12 --- Epoch: 22	Train loss: 0.7012	Valid loss: 0.8836	Train accuracy: 71.01	Valid accuracy: 70.19
21:36:06 --- Epoch: 23	Train loss: 0.7040	Valid loss: 0.7898	Train accuracy: 74.90	Valid accuracy: 73.79
21:36:58 --- Epoch: 24	Train loss: 0.6966	Valid loss: 0.7397	Train accuracy: 75.49	Valid accuracy: 74.72
21:37:54 --- Epoch: 25	Train loss: 0.6962	Valid loss: 0.7947	Train accuracy: 74.66	Valid accuracy: 73.52
21:38:47 --- Epoch: 26	Train loss: 0.6927	Valid loss: 0.7099	Train accuracy: 76.63	Valid accuracy: 76.25
21:39:41 --- Epoch: 27	Train loss: 0.6825	Valid loss: 0.6942	Train accuracy: 77.42	Valid accuracy: 76.53
21:40:34 --- Epoch: 28	Train loss: 0.6924	Valid loss: 0.7507	Train accuracy: 75.87	Valid accuracy: 74.70
21:41:27 --- Epoch: 29	Train loss: 0.6867	Valid loss: 0.7156	Train accuracy: 76.28	Valid accuracy: 75.68
21:42:20 --- Epoch: 30	Train loss: 0.6862	Valid loss: 0.7127	Train accuracy: 76.80	Valid accuracy: 75.98
21:43:14 --- Epoch: 31	Train loss: 0.6788	Valid loss: 0.9467	Train accuracy: 69.81	Valid accuracy: 69.02
21:44:07 --- Epoch: 32	Train loss: 0.6835	Valid loss: 0.8968	Train accuracy: 70.11	Valid accuracy: 70.03
21:45:00 --- Epoch: 33	Train loss: 0.6829	Valid loss: 0.7426	Train accuracy: 74.52	Valid accuracy: 74.32
21:45:53 --- Epoch: 34	Train loss: 0.6767	Valid loss: 0.7257	Train accuracy: 76.28	Valid accuracy: 75.59
21:46:47 --- Epoch: 35	Train loss: 0.6791	Valid loss: 1.0081	Train accuracy: 68.64	Valid accuracy: 68.83
21:47:40 --- Epoch: 36	Train loss: 0.6752	Valid loss: 0.8027	Train accuracy: 73.13	Valid accuracy: 73.35
21:48:37 --- Epoch: 37	Train loss: 0.6612	Valid loss: 0.7505	Train accuracy: 75.36	Valid accuracy: 74.31
21:49:30 --- Epoch: 38	Train loss: 0.6752	Valid loss: 0.7407	Train accuracy: 76.11	Valid accuracy: 75.14
21:50:24 --- Epoch: 39	Train loss: 0.6773	Valid loss: 0.7892	Train accuracy: 74.79	Valid accuracy: 73.34
21:51:18 --- Epoch: 40	Train loss: 0.6660	Valid loss: 0.7900	Train accuracy: 73.85	Valid accuracy: 73.28
21:52:11 --- Epoch: 41	Train loss: 0.6709	Valid loss: 0.7226	Train accuracy: 76.45	Valid accuracy: 75.59
21:53:07 --- Epoch: 42	Train loss: 0.6685	Valid loss: 0.8079	Train accuracy: 73.69	Valid accuracy: 73.17
21:54:00 --- Epoch: 43	Train loss: 0.6616	Valid loss: 0.7888	Train accuracy: 74.69	Valid accuracy: 74.08
21:54:53 --- Epoch: 44	Train loss: 0.6618	Valid loss: 0.7984	Train accuracy: 73.49	Valid accuracy: 73.44
21:55:46 --- Epoch: 45	Train loss: 0.6617	Valid loss: 0.8184	Train accuracy: 72.31	Valid accuracy: 72.93
21:56:40 --- Epoch: 46	Train loss: 0.6570	Valid loss: 0.6862	Train accuracy: 77.97	Valid accuracy: 76.86
21:57:33 --- Epoch: 47	Train loss: 0.6589	Valid loss: 0.7144	Train accuracy: 76.90	Valid accuracy: 76.52
21:58:26 --- Epoch: 48	Train loss: 0.6526	Valid loss: 0.7655	Train accuracy: 75.29	Valid accuracy: 74.68
21:59:19 --- Epoch: 49	Train loss: 0.6562	Valid loss: 0.7019	Train accuracy: 76.93	Valid accuracy: 76.37
22:00:12 --- Epoch: 50	Train loss: 0.6618	Valid loss: 0.8209	Train accuracy: 73.59	Valid accuracy: 72.91
22:01:06 --- Epoch: 51	Train loss: 0.6627	Valid loss: 0.7791	Train accuracy: 74.52	Valid accuracy: 74.08
22:01:59 --- Epoch: 52	Train loss: 0.6508	Valid loss: 0.7997	Train accuracy: 74.27	Valid accuracy: 72.93
22:02:52 --- Epoch: 53	Train loss: 0.6515	Valid loss: 0.7829	Train accuracy: 74.62	Valid accuracy: 73.71
22:03:46 --- Epoch: 54	Train loss: 0.6483	Valid loss: 0.7815	Train accuracy: 74.03	Valid accuracy: 74.11
22:04:39 --- Epoch: 55	Train loss: 0.6585	Valid loss: 0.7137	Train accuracy: 75.85	Valid accuracy: 76.03
22:05:36 --- Epoch: 56	Train loss: 0.6532	Valid loss: 0.7190	Train accuracy: 76.97	Valid accuracy: 76.60
22:06:31 --- Epoch: 57	Train loss: 0.6586	Valid loss: 0.6510	Train accuracy: 78.50	Valid accuracy: 78.01
22:07:26 --- Epoch: 58	Train loss: 0.6567	Valid loss: 0.7928	Train accuracy: 73.34	Valid accuracy: 73.47
22:08:25 --- Epoch: 59	Train loss: 0.6425	Valid loss: 0.7027	Train accuracy: 77.59	Valid accuracy: 76.28
22:09:24 --- Epoch: 60	Train loss: 0.6506	Valid loss: 0.7258	Train accuracy: 74.72	Valid accuracy: 75.41
						Learning Rate由0.1转为0.020000000000000004，下次epoch生效
22:10:25 --- Epoch: 61	Train loss: 0.4564	Valid loss: 0.4635	Train accuracy: 86.99	Valid accuracy: 84.29
22:11:27 --- Epoch: 62	Train loss: 0.4004	Valid loss: 0.4555	Train accuracy: 87.55	Valid accuracy: 84.47
22:12:29 --- Epoch: 63	Train loss: 0.3789	Valid loss: 0.4592	Train accuracy: 88.11	Valid accuracy: 84.61
22:13:29 --- Epoch: 64	Train loss: 0.3663	Valid loss: 0.4761	Train accuracy: 87.53	Valid accuracy: 83.77
22:14:29 --- Epoch: 65	Train loss: 0.3605	Valid loss: 0.4512	Train accuracy: 88.66	Valid accuracy: 84.67
22:15:29 --- Epoch: 66	Train loss: 0.3566	Valid loss: 0.4774	Train accuracy: 88.21	Valid accuracy: 84.21
22:16:28 --- Epoch: 67	Train loss: 0.3576	Valid loss: 0.5030	Train accuracy: 87.99	Valid accuracy: 83.57
22:17:30 --- Epoch: 68	Train loss: 0.3469	Valid loss: 0.4740	Train accuracy: 88.22	Valid accuracy: 84.40
22:18:28 --- Epoch: 69	Train loss: 0.3495	Valid loss: 0.4694	Train accuracy: 89.17	Valid accuracy: 84.46
22:19:24 --- Epoch: 70	Train loss: 0.3459	Valid loss: 0.4974	Train accuracy: 87.45	Valid accuracy: 83.39
22:20:21 --- Epoch: 71	Train loss: 0.3497	Valid loss: 0.5027	Train accuracy: 87.86	Valid accuracy: 83.64
22:21:20 --- Epoch: 72	Train loss: 0.3493	Valid loss: 0.4753	Train accuracy: 89.00	Valid accuracy: 84.49
22:22:18 --- Epoch: 73	Train loss: 0.3484	Valid loss: 0.4767	Train accuracy: 88.51	Valid accuracy: 84.11
22:23:21 --- Epoch: 74	Train loss: 0.3478	Valid loss: 0.4958	Train accuracy: 87.97	Valid accuracy: 83.93
22:24:20 --- Epoch: 75	Train loss: 0.3450	Valid loss: 0.4738	Train accuracy: 88.98	Valid accuracy: 84.58
22:25:16 --- Epoch: 76	Train loss: 0.3421	Valid loss: 0.4860	Train accuracy: 88.69	Valid accuracy: 83.82
22:26:12 --- Epoch: 77	Train loss: 0.3478	Valid loss: 0.5396	Train accuracy: 87.27	Valid accuracy: 82.62
22:27:10 --- Epoch: 78	Train loss: 0.3480	Valid loss: 0.5128	Train accuracy: 88.41	Valid accuracy: 82.96
22:28:08 --- Epoch: 79	Train loss: 0.3466	Valid loss: 0.5515	Train accuracy: 86.26	Valid accuracy: 82.14
22:29:07 --- Epoch: 80	Train loss: 0.3414	Valid loss: 0.4900	Train accuracy: 88.60	Valid accuracy: 84.04
22:30:11 --- Epoch: 81	Train loss: 0.3403	Valid loss: 0.5137	Train accuracy: 87.62	Valid accuracy: 83.20
22:31:23 --- Epoch: 82	Train loss: 0.3451	Valid loss: 0.4901	Train accuracy: 88.95	Valid accuracy: 83.66
22:32:26 --- Epoch: 83	Train loss: 0.3416	Valid loss: 0.4954	Train accuracy: 88.57	Valid accuracy: 83.85
22:33:26 --- Epoch: 84	Train loss: 0.3375	Valid loss: 0.5249	Train accuracy: 87.43	Valid accuracy: 83.13
22:34:21 --- Epoch: 85	Train loss: 0.3378	Valid loss: 0.5034	Train accuracy: 88.64	Valid accuracy: 83.44
22:35:16 --- Epoch: 86	Train loss: 0.3372	Valid loss: 0.5758	Train accuracy: 85.73	Valid accuracy: 81.21
22:36:13 --- Epoch: 87	Train loss: 0.3368	Valid loss: 0.5319	Train accuracy: 87.86	Valid accuracy: 82.91
22:37:09 --- Epoch: 88	Train loss: 0.3388	Valid loss: 0.5694	Train accuracy: 86.46	Valid accuracy: 81.94
22:38:06 --- Epoch: 89	Train loss: 0.3399	Valid loss: 0.4804	Train accuracy: 89.26	Valid accuracy: 84.26
22:39:00 --- Epoch: 90	Train loss: 0.3281	Valid loss: 0.5024	Train accuracy: 88.52	Valid accuracy: 83.90
22:39:53 --- Epoch: 91	Train loss: 0.3339	Valid loss: 0.5060	Train accuracy: 88.66	Valid accuracy: 83.23
22:40:46 --- Epoch: 92	Train loss: 0.3312	Valid loss: 0.5024	Train accuracy: 88.56	Valid accuracy: 83.68
22:41:46 --- Epoch: 93	Train loss: 0.3289	Valid loss: 0.5018	Train accuracy: 88.88	Valid accuracy: 83.76
22:42:41 --- Epoch: 94	Train loss: 0.3286	Valid loss: 0.5347	Train accuracy: 88.24	Valid accuracy: 82.46
22:43:36 --- Epoch: 95	Train loss: 0.3282	Valid loss: 0.5233	Train accuracy: 88.23	Valid accuracy: 83.18
22:44:30 --- Epoch: 96	Train loss: 0.3324	Valid loss: 0.5049	Train accuracy: 88.63	Valid accuracy: 83.52
22:45:25 --- Epoch: 97	Train loss: 0.3206	Valid loss: 0.4972	Train accuracy: 89.42	Valid accuracy: 83.86
22:46:19 --- Epoch: 98	Train loss: 0.3272	Valid loss: 0.4750	Train accuracy: 89.51	Valid accuracy: 84.25
22:47:17 --- Epoch: 99	Train loss: 0.3212	Valid loss: 0.5474	Train accuracy: 87.71	Valid accuracy: 82.60
22:48:23 --- Epoch: 100	Train loss: 0.3273	Valid loss: 0.5064	Train accuracy: 89.31	Valid accuracy: 83.54
22:49:22 --- Epoch: 101	Train loss: 0.3273	Valid loss: 0.5109	Train accuracy: 88.51	Valid accuracy: 83.12
22:50:26 --- Epoch: 102	Train loss: 0.3250	Valid loss: 0.5223	Train accuracy: 88.36	Valid accuracy: 82.73
22:51:36 --- Epoch: 103	Train loss: 0.3189	Valid loss: 0.4891	Train accuracy: 89.49	Valid accuracy: 84.16
22:52:50 --- Epoch: 104	Train loss: 0.3215	Valid loss: 0.5046	Train accuracy: 88.74	Valid accuracy: 84.02
22:53:57 --- Epoch: 105	Train loss: 0.3147	Valid loss: 0.5064	Train accuracy: 89.39	Valid accuracy: 83.64
22:55:05 --- Epoch: 106	Train loss: 0.3209	Valid loss: 0.5237	Train accuracy: 88.69	Valid accuracy: 83.32
22:56:12 --- Epoch: 107	Train loss: 0.3137	Valid loss: 0.5501	Train accuracy: 87.72	Valid accuracy: 82.36
22:57:17 --- Epoch: 108	Train loss: 0.3141	Valid loss: 0.5639	Train accuracy: 87.67	Valid accuracy: 82.43
22:58:21 --- Epoch: 109	Train loss: 0.3195	Valid loss: 0.4853	Train accuracy: 89.82	Valid accuracy: 84.42
22:59:26 --- Epoch: 110	Train loss: 0.3213	Valid loss: 0.4995	Train accuracy: 89.44	Valid accuracy: 83.98
23:00:29 --- Epoch: 111	Train loss: 0.3147	Valid loss: 0.5291	Train accuracy: 87.98	Valid accuracy: 82.99
23:01:33 --- Epoch: 112	Train loss: 0.3148	Valid loss: 0.5101	Train accuracy: 89.23	Valid accuracy: 83.82
23:02:43 --- Epoch: 113	Train loss: 0.3052	Valid loss: 0.4820	Train accuracy: 90.22	Valid accuracy: 84.33
23:03:52 --- Epoch: 114	Train loss: 0.3121	Valid loss: 0.5428	Train accuracy: 87.98	Valid accuracy: 82.92
23:04:54 --- Epoch: 115	Train loss: 0.3040	Valid loss: 0.5026	Train accuracy: 89.17	Valid accuracy: 83.74
23:05:54 --- Epoch: 116	Train loss: 0.3075	Valid loss: 0.4913	Train accuracy: 89.87	Valid accuracy: 83.87
23:06:54 --- Epoch: 117	Train loss: 0.3062	Valid loss: 0.4982	Train accuracy: 90.22	Valid accuracy: 83.92
23:07:56 --- Epoch: 118	Train loss: 0.3038	Valid loss: 0.5174	Train accuracy: 89.25	Valid accuracy: 83.67
23:08:59 --- Epoch: 119	Train loss: 0.3072	Valid loss: 0.4710	Train accuracy: 90.83	Valid accuracy: 84.87
23:09:58 --- Epoch: 120	Train loss: 0.2992	Valid loss: 0.4797	Train accuracy: 90.54	Valid accuracy: 84.27
						Learning Rate由0.020000000000000004转为0.004000000000000001，下次epoch生效
23:10:54 --- Epoch: 121	Train loss: 0.2001	Valid loss: 0.3911	Train accuracy: 95.02	Valid accuracy: 87.22
23:11:49 --- Epoch: 122	Train loss: 0.1599	Valid loss: 0.3878	Train accuracy: 95.47	Valid accuracy: 87.66
23:12:45 --- Epoch: 123	Train loss: 0.1482	Valid loss: 0.4009	Train accuracy: 95.70	Valid accuracy: 87.49
23:13:41 --- Epoch: 124	Train loss: 0.1372	Valid loss: 0.4043	Train accuracy: 95.99	Valid accuracy: 87.63
23:14:36 --- Epoch: 125	Train loss: 0.1312	Valid loss: 0.4102	Train accuracy: 96.16	Valid accuracy: 87.56
23:15:31 --- Epoch: 126	Train loss: 0.1241	Valid loss: 0.4124	Train accuracy: 96.39	Valid accuracy: 87.55
23:16:27 --- Epoch: 127	Train loss: 0.1197	Valid loss: 0.4220	Train accuracy: 96.63	Valid accuracy: 87.32
23:17:23 --- Epoch: 128	Train loss: 0.1167	Valid loss: 0.4169	Train accuracy: 96.76	Valid accuracy: 87.73
23:18:18 --- Epoch: 129	Train loss: 0.1123	Valid loss: 0.4137	Train accuracy: 96.88	Valid accuracy: 87.86
23:19:14 --- Epoch: 130	Train loss: 0.1124	Valid loss: 0.4272	Train accuracy: 97.08	Valid accuracy: 87.52
23:20:10 --- Epoch: 131	Train loss: 0.1076	Valid loss: 0.4297	Train accuracy: 97.12	Valid accuracy: 87.41
23:21:05 --- Epoch: 132	Train loss: 0.1032	Valid loss: 0.4281	Train accuracy: 97.19	Valid accuracy: 87.58
23:22:01 --- Epoch: 133	Train loss: 0.1016	Valid loss: 0.4369	Train accuracy: 97.08	Valid accuracy: 87.35
23:22:56 --- Epoch: 134	Train loss: 0.0959	Valid loss: 0.4308	Train accuracy: 97.34	Valid accuracy: 87.57
23:23:51 --- Epoch: 135	Train loss: 0.0993	Valid loss: 0.4349	Train accuracy: 97.27	Valid accuracy: 87.60
23:24:48 --- Epoch: 136	Train loss: 0.0973	Valid loss: 0.4389	Train accuracy: 97.46	Valid accuracy: 87.55
23:25:43 --- Epoch: 137	Train loss: 0.0929	Valid loss: 0.4543	Train accuracy: 97.37	Valid accuracy: 87.42
23:26:38 --- Epoch: 138	Train loss: 0.0910	Valid loss: 0.4510	Train accuracy: 97.50	Valid accuracy: 87.33
23:27:34 --- Epoch: 139	Train loss: 0.0938	Valid loss: 0.4492	Train accuracy: 97.37	Valid accuracy: 87.38
23:28:28 --- Epoch: 140	Train loss: 0.0856	Valid loss: 0.4575	Train accuracy: 97.62	Valid accuracy: 87.25
23:29:24 --- Epoch: 141	Train loss: 0.0906	Valid loss: 0.4572	Train accuracy: 97.46	Valid accuracy: 87.51
23:30:19 --- Epoch: 142	Train loss: 0.0907	Valid loss: 0.4524	Train accuracy: 97.60	Valid accuracy: 87.62
23:31:15 --- Epoch: 143	Train loss: 0.0893	Valid loss: 0.4434	Train accuracy: 97.53	Valid accuracy: 87.41
23:32:12 --- Epoch: 144	Train loss: 0.0854	Valid loss: 0.4597	Train accuracy: 97.45	Valid accuracy: 87.32
23:33:07 --- Epoch: 145	Train loss: 0.0863	Valid loss: 0.4635	Train accuracy: 97.44	Valid accuracy: 87.19
23:34:01 --- Epoch: 146	Train loss: 0.0862	Valid loss: 0.4813	Train accuracy: 97.35	Valid accuracy: 87.33
23:34:57 --- Epoch: 147	Train loss: 0.0843	Valid loss: 0.4657	Train accuracy: 97.50	Valid accuracy: 87.55
23:35:53 --- Epoch: 148	Train loss: 0.0881	Valid loss: 0.4738	Train accuracy: 97.41	Valid accuracy: 87.19
23:36:47 --- Epoch: 149	Train loss: 0.0879	Valid loss: 0.4671	Train accuracy: 97.53	Valid accuracy: 87.19
23:37:43 --- Epoch: 150	Train loss: 0.0877	Valid loss: 0.4796	Train accuracy: 97.53	Valid accuracy: 87.02
23:38:39 --- Epoch: 151	Train loss: 0.0840	Valid loss: 0.4706	Train accuracy: 97.61	Valid accuracy: 87.39
23:39:34 --- Epoch: 152	Train loss: 0.0828	Valid loss: 0.4898	Train accuracy: 97.56	Valid accuracy: 86.58
23:40:28 --- Epoch: 153	Train loss: 0.0860	Valid loss: 0.4887	Train accuracy: 97.28	Valid accuracy: 86.70
23:41:23 --- Epoch: 154	Train loss: 0.0897	Valid loss: 0.4934	Train accuracy: 97.34	Valid accuracy: 86.70
23:42:23 --- Epoch: 155	Train loss: 0.0909	Valid loss: 0.4880	Train accuracy: 97.49	Valid accuracy: 86.97
23:43:22 --- Epoch: 156	Train loss: 0.0857	Valid loss: 0.4865	Train accuracy: 97.35	Valid accuracy: 87.06
23:44:21 --- Epoch: 157	Train loss: 0.0872	Valid loss: 0.4762	Train accuracy: 97.64	Valid accuracy: 87.22
23:45:20 --- Epoch: 158	Train loss: 0.0854	Valid loss: 0.5078	Train accuracy: 97.57	Valid accuracy: 87.12
23:46:15 --- Epoch: 159	Train loss: 0.0842	Valid loss: 0.4896	Train accuracy: 97.51	Valid accuracy: 86.81
23:47:11 --- Epoch: 160	Train loss: 0.0884	Valid loss: 0.4918	Train accuracy: 97.54	Valid accuracy: 86.78
						Learning Rate由0.004000000000000001转为0.0008000000000000003，下次epoch生效
23:48:06 --- Epoch: 161	Train loss: 0.0620	Valid loss: 0.4417	Train accuracy: 98.80	Valid accuracy: 88.03
23:49:02 --- Epoch: 162	Train loss: 0.0494	Valid loss: 0.4415	Train accuracy: 98.93	Valid accuracy: 88.12
23:49:59 --- Epoch: 163	Train loss: 0.0450	Valid loss: 0.4387	Train accuracy: 99.08	Valid accuracy: 88.03
23:50:54 --- Epoch: 164	Train loss: 0.0426	Valid loss: 0.4459	Train accuracy: 98.91	Valid accuracy: 88.05
23:51:53 --- Epoch: 165	Train loss: 0.0396	Valid loss: 0.4504	Train accuracy: 99.06	Valid accuracy: 88.02
23:52:48 --- Epoch: 166	Train loss: 0.0409	Valid loss: 0.4486	Train accuracy: 99.04	Valid accuracy: 88.18
23:53:43 --- Epoch: 167	Train loss: 0.0376	Valid loss: 0.4497	Train accuracy: 99.17	Valid accuracy: 88.18
23:54:37 --- Epoch: 168	Train loss: 0.0360	Valid loss: 0.4532	Train accuracy: 99.23	Valid accuracy: 88.08
23:55:33 --- Epoch: 169	Train loss: 0.0359	Valid loss: 0.4602	Train accuracy: 99.25	Valid accuracy: 88.18
23:56:33 --- Epoch: 170	Train loss: 0.0354	Valid loss: 0.4617	Train accuracy: 99.35	Valid accuracy: 88.02
23:57:29 --- Epoch: 171	Train loss: 0.0325	Valid loss: 0.4617	Train accuracy: 99.38	Valid accuracy: 88.07
23:58:23 --- Epoch: 172	Train loss: 0.0331	Valid loss: 0.4559	Train accuracy: 99.34	Valid accuracy: 88.10
23:59:17 --- Epoch: 173	Train loss: 0.0309	Valid loss: 0.4637	Train accuracy: 99.35	Valid accuracy: 88.14
00:00:13 --- Epoch: 174	Train loss: 0.0291	Valid loss: 0.4665	Train accuracy: 99.39	Valid accuracy: 87.92
00:01:13 --- Epoch: 175	Train loss: 0.0307	Valid loss: 0.4648	Train accuracy: 99.41	Valid accuracy: 88.00
00:02:14 --- Epoch: 176	Train loss: 0.0290	Valid loss: 0.4652	Train accuracy: 99.42	Valid accuracy: 88.12
00:03:15 --- Epoch: 177	Train loss: 0.0286	Valid loss: 0.4637	Train accuracy: 99.41	Valid accuracy: 88.16
00:04:14 --- Epoch: 178	Train loss: 0.0294	Valid loss: 0.4613	Train accuracy: 99.43	Valid accuracy: 88.27
00:05:08 --- Epoch: 179	Train loss: 0.0270	Valid loss: 0.4628	Train accuracy: 99.48	Valid accuracy: 88.32
00:06:08 --- Epoch: 180	Train loss: 0.0277	Valid loss: 0.4655	Train accuracy: 99.48	Valid accuracy: 88.25
00:07:02 --- Epoch: 181	Train loss: 0.0280	Valid loss: 0.4695	Train accuracy: 99.48	Valid accuracy: 88.41
00:07:56 --- Epoch: 182	Train loss: 0.0274	Valid loss: 0.4714	Train accuracy: 99.49	Valid accuracy: 88.15
00:08:53 --- Epoch: 183	Train loss: 0.0256	Valid loss: 0.4707	Train accuracy: 99.54	Valid accuracy: 88.21
00:09:52 --- Epoch: 184	Train loss: 0.0248	Valid loss: 0.4749	Train accuracy: 99.48	Valid accuracy: 88.09
00:10:52 --- Epoch: 185	Train loss: 0.0247	Valid loss: 0.4731	Train accuracy: 99.53	Valid accuracy: 88.28
00:11:49 --- Epoch: 186	Train loss: 0.0264	Valid loss: 0.4730	Train accuracy: 99.51	Valid accuracy: 88.12
00:12:46 --- Epoch: 187	Train loss: 0.0259	Valid loss: 0.4784	Train accuracy: 99.58	Valid accuracy: 88.16
00:13:42 --- Epoch: 188	Train loss: 0.0241	Valid loss: 0.4752	Train accuracy: 99.55	Valid accuracy: 88.21
00:14:40 --- Epoch: 189	Train loss: 0.0242	Valid loss: 0.4797	Train accuracy: 99.49	Valid accuracy: 88.21
00:15:36 --- Epoch: 190	Train loss: 0.0247	Valid loss: 0.4732	Train accuracy: 99.62	Valid accuracy: 88.38
00:16:31 --- Epoch: 191	Train loss: 0.0244	Valid loss: 0.4769	Train accuracy: 99.61	Valid accuracy: 88.29
00:17:27 --- Epoch: 192	Train loss: 0.0236	Valid loss: 0.4742	Train accuracy: 99.58	Valid accuracy: 88.17
00:18:22 --- Epoch: 193	Train loss: 0.0239	Valid loss: 0.4784	Train accuracy: 99.60	Valid accuracy: 88.49
00:19:20 --- Epoch: 194	Train loss: 0.0227	Valid loss: 0.4814	Train accuracy: 99.60	Valid accuracy: 88.29
00:20:16 --- Epoch: 195	Train loss: 0.0223	Valid loss: 0.4866	Train accuracy: 99.60	Valid accuracy: 88.13
00:21:12 --- Epoch: 196	Train loss: 0.0220	Valid loss: 0.4879	Train accuracy: 99.65	Valid accuracy: 88.27
00:22:08 --- Epoch: 197	Train loss: 0.0219	Valid loss: 0.4932	Train accuracy: 99.60	Valid accuracy: 88.22
00:23:06 --- Epoch: 198	Train loss: 0.0223	Valid loss: 0.4912	Train accuracy: 99.60	Valid accuracy: 88.11
00:24:03 --- Epoch: 199	Train loss: 0.0206	Valid loss: 0.4937	Train accuracy: 99.66	Valid accuracy: 88.38
00:24:59 --- Epoch: 200	Train loss: 0.0218	Valid loss: 0.4940	Train accuracy: 99.62	Valid accuracy: 88.22
00:25:05 --- 当前时间戳为: 1648225499	top1 acc: 0.8822	top5 acc: 0.9926