----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]          36,864
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
 AdaptiveAvgPool2d-8             [-1, 64, 1, 1]               0
            Linear-9                    [-1, 4]             256
             ReLU-10                    [-1, 4]               0
           Linear-11                   [-1, 64]             256
          Sigmoid-12                   [-1, 64]               0
          SEBlock-13           [-1, 64, 56, 56]               0
           Conv2d-14           [-1, 64, 56, 56]          36,864
      BatchNorm2d-15           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-16             [-1, 64, 1, 1]               0
           Linear-17                    [-1, 4]             256
             ReLU-18                    [-1, 4]               0
           Linear-19                   [-1, 64]             256
          Sigmoid-20                   [-1, 64]               0
          SEBlock-21           [-1, 64, 56, 56]               0
             ReLU-22           [-1, 64, 56, 56]               0
  twoSEBasicBlock-23           [-1, 64, 56, 56]               0
           Conv2d-24           [-1, 64, 56, 56]          36,864
      BatchNorm2d-25           [-1, 64, 56, 56]             128
             ReLU-26           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-27             [-1, 64, 1, 1]               0
           Linear-28                    [-1, 4]             256
             ReLU-29                    [-1, 4]               0
           Linear-30                   [-1, 64]             256
          Sigmoid-31                   [-1, 64]               0
          SEBlock-32           [-1, 64, 56, 56]               0
           Conv2d-33           [-1, 64, 56, 56]          36,864
      BatchNorm2d-34           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-35             [-1, 64, 1, 1]               0
           Linear-36                    [-1, 4]             256
             ReLU-37                    [-1, 4]               0
           Linear-38                   [-1, 64]             256
          Sigmoid-39                   [-1, 64]               0
          SEBlock-40           [-1, 64, 56, 56]               0
             ReLU-41           [-1, 64, 56, 56]               0
  twoSEBasicBlock-42           [-1, 64, 56, 56]               0
           Conv2d-43          [-1, 128, 28, 28]          73,728
      BatchNorm2d-44          [-1, 128, 28, 28]             256
             ReLU-45          [-1, 128, 28, 28]               0
AdaptiveAvgPool2d-46            [-1, 128, 1, 1]               0
           Linear-47                    [-1, 8]           1,024
             ReLU-48                    [-1, 8]               0
           Linear-49                  [-1, 128]           1,024
          Sigmoid-50                  [-1, 128]               0
          SEBlock-51          [-1, 128, 28, 28]               0
           Conv2d-52          [-1, 128, 28, 28]         147,456
      BatchNorm2d-53          [-1, 128, 28, 28]             256
AdaptiveAvgPool2d-54            [-1, 128, 1, 1]               0
           Linear-55                    [-1, 8]           1,024
             ReLU-56                    [-1, 8]               0
           Linear-57                  [-1, 128]           1,024
          Sigmoid-58                  [-1, 128]               0
          SEBlock-59          [-1, 128, 28, 28]               0
           Conv2d-60          [-1, 128, 28, 28]           8,192
      BatchNorm2d-61          [-1, 128, 28, 28]             256
             ReLU-62          [-1, 128, 28, 28]               0
  twoSEBasicBlock-63          [-1, 128, 28, 28]               0
           Conv2d-64          [-1, 128, 28, 28]         147,456
      BatchNorm2d-65          [-1, 128, 28, 28]             256
             ReLU-66          [-1, 128, 28, 28]               0
AdaptiveAvgPool2d-67            [-1, 128, 1, 1]               0
           Linear-68                    [-1, 8]           1,024
             ReLU-69                    [-1, 8]               0
           Linear-70                  [-1, 128]           1,024
          Sigmoid-71                  [-1, 128]               0
          SEBlock-72          [-1, 128, 28, 28]               0
           Conv2d-73          [-1, 128, 28, 28]         147,456
      BatchNorm2d-74          [-1, 128, 28, 28]             256
AdaptiveAvgPool2d-75            [-1, 128, 1, 1]               0
           Linear-76                    [-1, 8]           1,024
             ReLU-77                    [-1, 8]               0
           Linear-78                  [-1, 128]           1,024
          Sigmoid-79                  [-1, 128]               0
          SEBlock-80          [-1, 128, 28, 28]               0
             ReLU-81          [-1, 128, 28, 28]               0
  twoSEBasicBlock-82          [-1, 128, 28, 28]               0
           Conv2d-83          [-1, 256, 14, 14]         294,912
      BatchNorm2d-84          [-1, 256, 14, 14]             512
             ReLU-85          [-1, 256, 14, 14]               0
AdaptiveAvgPool2d-86            [-1, 256, 1, 1]               0
           Linear-87                   [-1, 16]           4,096
             ReLU-88                   [-1, 16]               0
           Linear-89                  [-1, 256]           4,096
          Sigmoid-90                  [-1, 256]               0
          SEBlock-91          [-1, 256, 14, 14]               0
           Conv2d-92          [-1, 256, 14, 14]         589,824
      BatchNorm2d-93          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-94            [-1, 256, 1, 1]               0
           Linear-95                   [-1, 16]           4,096
             ReLU-96                   [-1, 16]               0
           Linear-97                  [-1, 256]           4,096
          Sigmoid-98                  [-1, 256]               0
          SEBlock-99          [-1, 256, 14, 14]               0
          Conv2d-100          [-1, 256, 14, 14]          32,768
     BatchNorm2d-101          [-1, 256, 14, 14]             512
            ReLU-102          [-1, 256, 14, 14]               0
 twoSEBasicBlock-103          [-1, 256, 14, 14]               0
          Conv2d-104          [-1, 256, 14, 14]         589,824
     BatchNorm2d-105          [-1, 256, 14, 14]             512
            ReLU-106          [-1, 256, 14, 14]               0
AdaptiveAvgPool2d-107            [-1, 256, 1, 1]               0
          Linear-108                   [-1, 16]           4,096
            ReLU-109                   [-1, 16]               0
          Linear-110                  [-1, 256]           4,096
         Sigmoid-111                  [-1, 256]               0
         SEBlock-112          [-1, 256, 14, 14]               0
          Conv2d-113          [-1, 256, 14, 14]         589,824
     BatchNorm2d-114          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-115            [-1, 256, 1, 1]               0
          Linear-116                   [-1, 16]           4,096
            ReLU-117                   [-1, 16]               0
          Linear-118                  [-1, 256]           4,096
         Sigmoid-119                  [-1, 256]               0
         SEBlock-120          [-1, 256, 14, 14]               0
            ReLU-121          [-1, 256, 14, 14]               0
 twoSEBasicBlock-122          [-1, 256, 14, 14]               0
          Conv2d-123            [-1, 512, 7, 7]       1,179,648
     BatchNorm2d-124            [-1, 512, 7, 7]           1,024
            ReLU-125            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-126            [-1, 512, 1, 1]               0
          Linear-127                   [-1, 32]          16,384
            ReLU-128                   [-1, 32]               0
          Linear-129                  [-1, 512]          16,384
         Sigmoid-130                  [-1, 512]               0
         SEBlock-131            [-1, 512, 7, 7]               0
          Conv2d-132            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-133            [-1, 512, 7, 7]           1,024
AdaptiveAvgPool2d-134            [-1, 512, 1, 1]               0
          Linear-135                   [-1, 32]          16,384
            ReLU-136                   [-1, 32]               0
          Linear-137                  [-1, 512]          16,384
         Sigmoid-138                  [-1, 512]               0
         SEBlock-139            [-1, 512, 7, 7]               0
          Conv2d-140            [-1, 512, 7, 7]         131,072
     BatchNorm2d-141            [-1, 512, 7, 7]           1,024
            ReLU-142            [-1, 512, 7, 7]               0
 twoSEBasicBlock-143            [-1, 512, 7, 7]               0
          Conv2d-144            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-145            [-1, 512, 7, 7]           1,024
            ReLU-146            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-147            [-1, 512, 1, 1]               0
          Linear-148                   [-1, 32]          16,384
            ReLU-149                   [-1, 32]               0
          Linear-150                  [-1, 512]          16,384
         Sigmoid-151                  [-1, 512]               0
         SEBlock-152            [-1, 512, 7, 7]               0
          Conv2d-153            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-154            [-1, 512, 7, 7]           1,024
AdaptiveAvgPool2d-155            [-1, 512, 1, 1]               0
          Linear-156                   [-1, 32]          16,384
            ReLU-157                   [-1, 32]               0
          Linear-158                  [-1, 512]          16,384
         Sigmoid-159                  [-1, 512]               0
         SEBlock-160            [-1, 512, 7, 7]               0
            ReLU-161            [-1, 512, 7, 7]               0
 twoSEBasicBlock-162            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-163            [-1, 512, 1, 1]               0
          Linear-164                 [-1, 1000]         513,000
================================================================
Total params: 11,863,592
Trainable params: 11,863,592
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 74.37
Params size (MB): 45.26
Estimated Total Size (MB): 120.20
----------------------------------------------------------------
#Params: 11.9M
16:07:55 --- Start training loop	training on: cuda
16:08:50 --- Epoch: 1	Train loss: 2.0263	Valid loss: 1.5961	Train accuracy: 37.56	Valid accuracy: 39.10
16:09:46 --- Epoch: 2	Train loss: 1.5608	Valid loss: 1.4317	Train accuracy: 46.89	Valid accuracy: 49.68
16:10:42 --- Epoch: 3	Train loss: 1.3894	Valid loss: 1.3688	Train accuracy: 50.90	Valid accuracy: 52.71
16:11:37 --- Epoch: 4	Train loss: 1.2595	Valid loss: 1.2348	Train accuracy: 54.88	Valid accuracy: 57.82
16:12:33 --- Epoch: 5	Train loss: 1.1853	Valid loss: 1.1716	Train accuracy: 57.11	Valid accuracy: 60.10
16:13:28 --- Epoch: 6	Train loss: 1.0989	Valid loss: 1.0252	Train accuracy: 63.14	Valid accuracy: 64.73
16:14:23 --- Epoch: 7	Train loss: 1.0383	Valid loss: 0.9709	Train accuracy: 65.14	Valid accuracy: 67.25
16:15:20 --- Epoch: 8	Train loss: 0.9972	Valid loss: 1.1131	Train accuracy: 62.67	Valid accuracy: 64.04
16:16:15 --- Epoch: 9	Train loss: 0.9494	Valid loss: 0.9291	Train accuracy: 68.08	Valid accuracy: 68.45
16:17:12 --- Epoch: 10	Train loss: 0.9187	Valid loss: 0.8679	Train accuracy: 70.04	Valid accuracy: 70.52
16:18:07 --- Epoch: 11	Train loss: 0.8830	Valid loss: 0.8823	Train accuracy: 68.79	Valid accuracy: 69.79
16:19:03 --- Epoch: 12	Train loss: 0.8637	Valid loss: 0.8398	Train accuracy: 71.60	Valid accuracy: 72.27
16:19:58 --- Epoch: 13	Train loss: 0.8402	Valid loss: 0.8444	Train accuracy: 70.66	Valid accuracy: 70.90
16:20:54 --- Epoch: 14	Train loss: 0.8222	Valid loss: 0.8166	Train accuracy: 71.84	Valid accuracy: 73.28
16:21:49 --- Epoch: 15	Train loss: 0.7992	Valid loss: 0.7800	Train accuracy: 74.28	Valid accuracy: 74.29
16:22:45 --- Epoch: 16	Train loss: 0.7809	Valid loss: 0.7964	Train accuracy: 74.06	Valid accuracy: 73.27
16:23:40 --- Epoch: 17	Train loss: 0.7803	Valid loss: 0.8302	Train accuracy: 73.89	Valid accuracy: 74.04
16:24:37 --- Epoch: 18	Train loss: 0.7583	Valid loss: 0.7377	Train accuracy: 75.07	Valid accuracy: 74.76
16:25:32 --- Epoch: 19	Train loss: 0.7343	Valid loss: 0.7773	Train accuracy: 75.24	Valid accuracy: 74.79
16:26:28 --- Epoch: 20	Train loss: 0.7174	Valid loss: 0.7505	Train accuracy: 75.53	Valid accuracy: 75.05
16:27:27 --- Epoch: 21	Train loss: 0.7206	Valid loss: 0.7128	Train accuracy: 76.48	Valid accuracy: 76.35
16:28:23 --- Epoch: 22	Train loss: 0.7094	Valid loss: 0.7409	Train accuracy: 75.87	Valid accuracy: 75.15
16:29:18 --- Epoch: 23	Train loss: 0.6969	Valid loss: 0.7393	Train accuracy: 76.60	Valid accuracy: 76.07
16:30:16 --- Epoch: 24	Train loss: 0.6819	Valid loss: 0.7718	Train accuracy: 76.29	Valid accuracy: 75.91
16:31:13 --- Epoch: 25	Train loss: 0.6772	Valid loss: 0.6811	Train accuracy: 78.72	Valid accuracy: 78.00
16:32:09 --- Epoch: 26	Train loss: 0.6693	Valid loss: 0.7015	Train accuracy: 78.05	Valid accuracy: 76.74
16:33:04 --- Epoch: 27	Train loss: 0.6584	Valid loss: 0.7057	Train accuracy: 78.39	Valid accuracy: 76.49
16:34:00 --- Epoch: 28	Train loss: 0.6371	Valid loss: 0.6666	Train accuracy: 79.52	Valid accuracy: 78.00
16:34:55 --- Epoch: 29	Train loss: 0.6316	Valid loss: 0.6822	Train accuracy: 79.33	Valid accuracy: 78.09
16:35:51 --- Epoch: 30	Train loss: 0.6332	Valid loss: 0.6590	Train accuracy: 79.86	Valid accuracy: 78.20
16:36:46 --- Epoch: 31	Train loss: 0.6177	Valid loss: 0.6762	Train accuracy: 80.29	Valid accuracy: 78.26
16:37:42 --- Epoch: 32	Train loss: 0.6253	Valid loss: 0.7216	Train accuracy: 78.90	Valid accuracy: 77.35
16:38:37 --- Epoch: 33	Train loss: 0.6094	Valid loss: 0.6860	Train accuracy: 79.42	Valid accuracy: 77.38
16:39:33 --- Epoch: 34	Train loss: 0.6063	Valid loss: 0.6857	Train accuracy: 79.44	Valid accuracy: 77.59
16:40:28 --- Epoch: 35	Train loss: 0.6029	Valid loss: 0.6605	Train accuracy: 80.58	Valid accuracy: 78.22
16:41:24 --- Epoch: 36	Train loss: 0.5932	Valid loss: 0.6938	Train accuracy: 79.77	Valid accuracy: 78.68
16:42:19 --- Epoch: 37	Train loss: 0.5765	Valid loss: 0.7401	Train accuracy: 78.82	Valid accuracy: 76.42
16:43:15 --- Epoch: 38	Train loss: 0.5771	Valid loss: 0.6927	Train accuracy: 81.13	Valid accuracy: 78.13
16:44:10 --- Epoch: 39	Train loss: 0.5671	Valid loss: 0.6411	Train accuracy: 82.19	Valid accuracy: 79.68
16:45:05 --- Epoch: 40	Train loss: 0.5677	Valid loss: 0.6472	Train accuracy: 81.34	Valid accuracy: 78.97
16:46:01 --- Epoch: 41	Train loss: 0.5607	Valid loss: 0.6172	Train accuracy: 82.46	Valid accuracy: 79.78
16:46:57 --- Epoch: 42	Train loss: 0.5636	Valid loss: 0.6713	Train accuracy: 80.70	Valid accuracy: 78.70
16:47:53 --- Epoch: 43	Train loss: 0.5573	Valid loss: 0.6683	Train accuracy: 80.39	Valid accuracy: 78.47
16:48:48 --- Epoch: 44	Train loss: 0.5492	Valid loss: 0.6422	Train accuracy: 81.73	Valid accuracy: 78.69
16:49:44 --- Epoch: 45	Train loss: 0.5411	Valid loss: 0.6188	Train accuracy: 82.51	Valid accuracy: 79.62
16:50:40 --- Epoch: 46	Train loss: 0.5454	Valid loss: 0.6312	Train accuracy: 81.85	Valid accuracy: 79.99
16:51:36 --- Epoch: 47	Train loss: 0.5454	Valid loss: 0.6058	Train accuracy: 82.85	Valid accuracy: 80.33
16:52:32 --- Epoch: 48	Train loss: 0.5398	Valid loss: 0.6499	Train accuracy: 82.68	Valid accuracy: 79.61
16:53:28 --- Epoch: 49	Train loss: 0.5300	Valid loss: 0.6398	Train accuracy: 82.39	Valid accuracy: 79.65
16:54:23 --- Epoch: 50	Train loss: 0.5295	Valid loss: 0.6295	Train accuracy: 82.85	Valid accuracy: 79.91
16:55:20 --- Epoch: 51	Train loss: 0.5299	Valid loss: 0.6199	Train accuracy: 83.28	Valid accuracy: 80.72
16:56:16 --- Epoch: 52	Train loss: 0.5189	Valid loss: 0.6374	Train accuracy: 82.23	Valid accuracy: 79.46
16:57:11 --- Epoch: 53	Train loss: 0.5213	Valid loss: 0.6524	Train accuracy: 83.28	Valid accuracy: 80.31
16:58:07 --- Epoch: 54	Train loss: 0.5181	Valid loss: 0.6624	Train accuracy: 81.70	Valid accuracy: 79.30
16:59:02 --- Epoch: 55	Train loss: 0.5237	Valid loss: 0.6526	Train accuracy: 82.64	Valid accuracy: 79.16
16:59:58 --- Epoch: 56	Train loss: 0.5111	Valid loss: 0.6092	Train accuracy: 84.07	Valid accuracy: 81.00
17:00:54 --- Epoch: 57	Train loss: 0.5161	Valid loss: 0.6461	Train accuracy: 82.87	Valid accuracy: 80.01
17:01:49 --- Epoch: 58	Train loss: 0.5072	Valid loss: 0.6720	Train accuracy: 83.63	Valid accuracy: 79.83
17:02:45 --- Epoch: 59	Train loss: 0.5009	Valid loss: 0.5927	Train accuracy: 84.59	Valid accuracy: 81.10
17:03:40 --- Epoch: 60	Train loss: 0.4950	Valid loss: 0.6740	Train accuracy: 83.34	Valid accuracy: 79.04
						Learning Rate由0.1转为0.020000000000000004，下次epoch生效
17:04:37 --- Epoch: 61	Train loss: 0.4179	Valid loss: 0.5237	Train accuracy: 87.40	Valid accuracy: 83.11
17:05:32 --- Epoch: 62	Train loss: 0.3914	Valid loss: 0.5255	Train accuracy: 87.74	Valid accuracy: 82.85
17:06:27 --- Epoch: 63	Train loss: 0.3857	Valid loss: 0.5327	Train accuracy: 87.41	Valid accuracy: 82.95
17:07:23 --- Epoch: 64	Train loss: 0.3831	Valid loss: 0.5259	Train accuracy: 87.76	Valid accuracy: 83.02
17:08:18 --- Epoch: 65	Train loss: 0.3766	Valid loss: 0.5254	Train accuracy: 87.93	Valid accuracy: 83.18
17:09:14 --- Epoch: 66	Train loss: 0.3761	Valid loss: 0.5313	Train accuracy: 87.71	Valid accuracy: 82.77
17:10:10 --- Epoch: 67	Train loss: 0.3668	Valid loss: 0.5228	Train accuracy: 88.24	Valid accuracy: 83.09
17:11:05 --- Epoch: 68	Train loss: 0.3686	Valid loss: 0.5267	Train accuracy: 88.49	Valid accuracy: 83.32
17:12:00 --- Epoch: 69	Train loss: 0.3653	Valid loss: 0.5241	Train accuracy: 88.64	Valid accuracy: 83.18
17:12:56 --- Epoch: 70	Train loss: 0.3659	Valid loss: 0.5331	Train accuracy: 88.38	Valid accuracy: 82.67
17:13:52 --- Epoch: 71	Train loss: 0.3609	Valid loss: 0.5353	Train accuracy: 88.40	Valid accuracy: 83.05
17:14:47 --- Epoch: 72	Train loss: 0.3598	Valid loss: 0.5214	Train accuracy: 88.78	Valid accuracy: 83.37
17:15:43 --- Epoch: 73	Train loss: 0.3581	Valid loss: 0.5119	Train accuracy: 88.82	Valid accuracy: 83.52
17:16:39 --- Epoch: 74	Train loss: 0.3561	Valid loss: 0.5238	Train accuracy: 89.17	Valid accuracy: 83.48
17:17:35 --- Epoch: 75	Train loss: 0.3559	Valid loss: 0.5311	Train accuracy: 88.77	Valid accuracy: 83.05
17:18:30 --- Epoch: 76	Train loss: 0.3534	Valid loss: 0.5280	Train accuracy: 88.91	Valid accuracy: 82.95
17:19:26 --- Epoch: 77	Train loss: 0.3482	Valid loss: 0.5293	Train accuracy: 88.88	Valid accuracy: 83.28
17:20:22 --- Epoch: 78	Train loss: 0.3517	Valid loss: 0.5277	Train accuracy: 88.71	Valid accuracy: 82.93
17:21:17 --- Epoch: 79	Train loss: 0.3451	Valid loss: 0.5401	Train accuracy: 88.84	Valid accuracy: 83.09
17:22:13 --- Epoch: 80	Train loss: 0.3422	Valid loss: 0.5405	Train accuracy: 88.79	Valid accuracy: 83.00
17:23:08 --- Epoch: 81	Train loss: 0.3476	Valid loss: 0.5233	Train accuracy: 89.07	Valid accuracy: 83.13
17:24:04 --- Epoch: 82	Train loss: 0.3430	Valid loss: 0.5379	Train accuracy: 89.18	Valid accuracy: 82.61
17:24:59 --- Epoch: 83	Train loss: 0.3435	Valid loss: 0.5225	Train accuracy: 89.46	Valid accuracy: 83.29
17:25:54 --- Epoch: 84	Train loss: 0.3358	Valid loss: 0.5322	Train accuracy: 89.15	Valid accuracy: 83.15
17:26:50 --- Epoch: 85	Train loss: 0.3348	Valid loss: 0.5255	Train accuracy: 89.74	Valid accuracy: 83.25
17:27:46 --- Epoch: 86	Train loss: 0.3361	Valid loss: 0.5350	Train accuracy: 89.19	Valid accuracy: 83.17
17:28:41 --- Epoch: 87	Train loss: 0.3369	Valid loss: 0.5405	Train accuracy: 89.31	Valid accuracy: 82.96
17:29:37 --- Epoch: 88	Train loss: 0.3375	Valid loss: 0.5261	Train accuracy: 89.36	Valid accuracy: 82.98
17:30:33 --- Epoch: 89	Train loss: 0.3358	Valid loss: 0.5372	Train accuracy: 89.52	Valid accuracy: 83.04
17:31:30 --- Epoch: 90	Train loss: 0.3311	Valid loss: 0.5381	Train accuracy: 89.56	Valid accuracy: 83.10
17:32:27 --- Epoch: 91	Train loss: 0.3324	Valid loss: 0.5288	Train accuracy: 89.87	Valid accuracy: 83.18
17:33:23 --- Epoch: 92	Train loss: 0.3264	Valid loss: 0.5386	Train accuracy: 89.63	Valid accuracy: 83.20
17:34:20 --- Epoch: 93	Train loss: 0.3289	Valid loss: 0.5394	Train accuracy: 89.69	Valid accuracy: 83.45
17:35:17 --- Epoch: 94	Train loss: 0.3307	Valid loss: 0.5472	Train accuracy: 89.24	Valid accuracy: 82.94
17:36:12 --- Epoch: 95	Train loss: 0.3306	Valid loss: 0.5346	Train accuracy: 89.55	Valid accuracy: 83.24
17:37:09 --- Epoch: 96	Train loss: 0.3245	Valid loss: 0.5278	Train accuracy: 89.66	Valid accuracy: 83.26
17:38:05 --- Epoch: 97	Train loss: 0.3244	Valid loss: 0.5345	Train accuracy: 89.96	Valid accuracy: 83.06
17:39:00 --- Epoch: 98	Train loss: 0.3241	Valid loss: 0.5380	Train accuracy: 89.77	Valid accuracy: 83.39
17:39:56 --- Epoch: 99	Train loss: 0.3220	Valid loss: 0.5298	Train accuracy: 89.83	Valid accuracy: 83.28
17:40:51 --- Epoch: 100	Train loss: 0.3193	Valid loss: 0.5420	Train accuracy: 89.76	Valid accuracy: 83.21
17:41:47 --- Epoch: 101	Train loss: 0.3207	Valid loss: 0.5407	Train accuracy: 89.81	Valid accuracy: 83.13
17:42:43 --- Epoch: 102	Train loss: 0.3179	Valid loss: 0.5359	Train accuracy: 89.91	Valid accuracy: 83.19
17:43:38 --- Epoch: 103	Train loss: 0.3163	Valid loss: 0.5387	Train accuracy: 89.70	Valid accuracy: 83.43
17:44:33 --- Epoch: 104	Train loss: 0.3140	Valid loss: 0.5386	Train accuracy: 89.92	Valid accuracy: 83.48
17:45:30 --- Epoch: 105	Train loss: 0.3192	Valid loss: 0.5369	Train accuracy: 89.72	Valid accuracy: 83.23
17:46:25 --- Epoch: 106	Train loss: 0.3174	Valid loss: 0.5356	Train accuracy: 90.06	Valid accuracy: 83.49
17:47:20 --- Epoch: 107	Train loss: 0.3118	Valid loss: 0.5317	Train accuracy: 90.12	Valid accuracy: 83.48
17:48:16 --- Epoch: 108	Train loss: 0.3144	Valid loss: 0.5313	Train accuracy: 90.29	Valid accuracy: 83.61
17:49:12 --- Epoch: 109	Train loss: 0.3085	Valid loss: 0.5330	Train accuracy: 90.19	Valid accuracy: 83.31
17:50:07 --- Epoch: 110	Train loss: 0.3132	Valid loss: 0.5513	Train accuracy: 90.14	Valid accuracy: 82.96
17:51:02 --- Epoch: 111	Train loss: 0.3069	Valid loss: 0.5433	Train accuracy: 90.09	Valid accuracy: 83.21
17:51:58 --- Epoch: 112	Train loss: 0.3084	Valid loss: 0.5337	Train accuracy: 90.20	Valid accuracy: 83.31
17:52:53 --- Epoch: 113	Train loss: 0.3090	Valid loss: 0.5343	Train accuracy: 90.31	Valid accuracy: 83.65
17:53:49 --- Epoch: 114	Train loss: 0.3089	Valid loss: 0.5456	Train accuracy: 90.12	Valid accuracy: 82.89
17:54:44 --- Epoch: 115	Train loss: 0.3063	Valid loss: 0.5387	Train accuracy: 90.13	Valid accuracy: 83.48
17:55:40 --- Epoch: 116	Train loss: 0.3047	Valid loss: 0.5413	Train accuracy: 90.48	Valid accuracy: 83.34
17:56:35 --- Epoch: 117	Train loss: 0.3014	Valid loss: 0.5360	Train accuracy: 90.52	Valid accuracy: 83.40
17:57:31 --- Epoch: 118	Train loss: 0.3025	Valid loss: 0.5383	Train accuracy: 90.57	Valid accuracy: 83.28
17:58:26 --- Epoch: 119	Train loss: 0.3054	Valid loss: 0.5389	Train accuracy: 90.47	Valid accuracy: 83.52
17:59:21 --- Epoch: 120	Train loss: 0.3006	Valid loss: 0.5383	Train accuracy: 90.55	Valid accuracy: 83.80
						Learning Rate由0.020000000000000004转为0.004000000000000001，下次epoch生效
18:00:17 --- Epoch: 121	Train loss: 0.2823	Valid loss: 0.5318	Train accuracy: 91.09	Valid accuracy: 83.84
18:01:13 --- Epoch: 122	Train loss: 0.2826	Valid loss: 0.5272	Train accuracy: 90.97	Valid accuracy: 83.96
18:02:09 --- Epoch: 123	Train loss: 0.2803	Valid loss: 0.5293	Train accuracy: 91.10	Valid accuracy: 83.85
18:03:04 --- Epoch: 124	Train loss: 0.2750	Valid loss: 0.5296	Train accuracy: 91.26	Valid accuracy: 84.20
18:04:00 --- Epoch: 125	Train loss: 0.2777	Valid loss: 0.5264	Train accuracy: 91.21	Valid accuracy: 84.00
18:04:56 --- Epoch: 126	Train loss: 0.2778	Valid loss: 0.5266	Train accuracy: 91.27	Valid accuracy: 83.93
18:05:52 --- Epoch: 127	Train loss: 0.2732	Valid loss: 0.5301	Train accuracy: 91.41	Valid accuracy: 83.98
18:06:48 --- Epoch: 128	Train loss: 0.2731	Valid loss: 0.5293	Train accuracy: 91.22	Valid accuracy: 84.08
18:07:45 --- Epoch: 129	Train loss: 0.2747	Valid loss: 0.5235	Train accuracy: 91.35	Valid accuracy: 83.94
18:08:40 --- Epoch: 130	Train loss: 0.2780	Valid loss: 0.5331	Train accuracy: 91.24	Valid accuracy: 83.79
18:09:36 --- Epoch: 131	Train loss: 0.2740	Valid loss: 0.5294	Train accuracy: 91.33	Valid accuracy: 83.90
18:10:32 --- Epoch: 132	Train loss: 0.2756	Valid loss: 0.5289	Train accuracy: 91.31	Valid accuracy: 83.79
18:11:27 --- Epoch: 133	Train loss: 0.2688	Valid loss: 0.5374	Train accuracy: 91.32	Valid accuracy: 83.48
18:12:22 --- Epoch: 134	Train loss: 0.2721	Valid loss: 0.5338	Train accuracy: 91.39	Valid accuracy: 83.78
18:13:18 --- Epoch: 135	Train loss: 0.2712	Valid loss: 0.5302	Train accuracy: 91.58	Valid accuracy: 83.76
18:14:13 --- Epoch: 136	Train loss: 0.2735	Valid loss: 0.5353	Train accuracy: 91.38	Valid accuracy: 83.74
18:15:09 --- Epoch: 137	Train loss: 0.2705	Valid loss: 0.5346	Train accuracy: 91.36	Valid accuracy: 83.90
18:16:04 --- Epoch: 138	Train loss: 0.2751	Valid loss: 0.5280	Train accuracy: 91.49	Valid accuracy: 84.06
18:17:00 --- Epoch: 139	Train loss: 0.2693	Valid loss: 0.5345	Train accuracy: 91.25	Valid accuracy: 83.82
18:17:55 --- Epoch: 140	Train loss: 0.2704	Valid loss: 0.5362	Train accuracy: 91.42	Valid accuracy: 83.70
18:18:50 --- Epoch: 141	Train loss: 0.2706	Valid loss: 0.5383	Train accuracy: 91.35	Valid accuracy: 83.93
18:19:45 --- Epoch: 142	Train loss: 0.2697	Valid loss: 0.5366	Train accuracy: 91.42	Valid accuracy: 83.78
18:20:41 --- Epoch: 143	Train loss: 0.2695	Valid loss: 0.5395	Train accuracy: 91.54	Valid accuracy: 83.62
18:21:36 --- Epoch: 144	Train loss: 0.2695	Valid loss: 0.5327	Train accuracy: 91.48	Valid accuracy: 83.79
18:22:32 --- Epoch: 145	Train loss: 0.2679	Valid loss: 0.5391	Train accuracy: 91.54	Valid accuracy: 83.73
18:23:27 --- Epoch: 146	Train loss: 0.2660	Valid loss: 0.5368	Train accuracy: 91.44	Valid accuracy: 83.85
18:24:23 --- Epoch: 147	Train loss: 0.2661	Valid loss: 0.5408	Train accuracy: 91.56	Valid accuracy: 84.04
18:25:18 --- Epoch: 148	Train loss: 0.2683	Valid loss: 0.5415	Train accuracy: 91.48	Valid accuracy: 83.84
18:26:13 --- Epoch: 149	Train loss: 0.2650	Valid loss: 0.5411	Train accuracy: 91.56	Valid accuracy: 83.56
18:27:08 --- Epoch: 150	Train loss: 0.2666	Valid loss: 0.5383	Train accuracy: 91.64	Valid accuracy: 83.68
18:28:04 --- Epoch: 151	Train loss: 0.2610	Valid loss: 0.5390	Train accuracy: 91.71	Valid accuracy: 83.69
18:29:00 --- Epoch: 152	Train loss: 0.2622	Valid loss: 0.5425	Train accuracy: 91.57	Valid accuracy: 83.79
18:29:55 --- Epoch: 153	Train loss: 0.2644	Valid loss: 0.5351	Train accuracy: 91.51	Valid accuracy: 83.74
18:30:50 --- Epoch: 154	Train loss: 0.2658	Valid loss: 0.5490	Train accuracy: 91.51	Valid accuracy: 83.75
18:31:46 --- Epoch: 155	Train loss: 0.2679	Valid loss: 0.5334	Train accuracy: 91.38	Valid accuracy: 83.86
18:32:41 --- Epoch: 156	Train loss: 0.2663	Valid loss: 0.5420	Train accuracy: 91.58	Valid accuracy: 83.54
18:33:36 --- Epoch: 157	Train loss: 0.2637	Valid loss: 0.5392	Train accuracy: 91.41	Valid accuracy: 83.54
18:34:32 --- Epoch: 158	Train loss: 0.2638	Valid loss: 0.5465	Train accuracy: 91.47	Valid accuracy: 83.82
18:35:27 --- Epoch: 159	Train loss: 0.2660	Valid loss: 0.5409	Train accuracy: 91.52	Valid accuracy: 83.65
18:36:23 --- Epoch: 160	Train loss: 0.2659	Valid loss: 0.5414	Train accuracy: 91.64	Valid accuracy: 83.62
						Learning Rate由0.004000000000000001转为0.0008000000000000003，下次epoch生效
18:37:24 --- Epoch: 161	Train loss: 0.2612	Valid loss: 0.5368	Train accuracy: 91.53	Valid accuracy: 83.81
18:38:22 --- Epoch: 162	Train loss: 0.2641	Valid loss: 0.5387	Train accuracy: 91.76	Valid accuracy: 83.71
18:39:20 --- Epoch: 163	Train loss: 0.2622	Valid loss: 0.5392	Train accuracy: 91.79	Valid accuracy: 83.90
18:40:18 --- Epoch: 164	Train loss: 0.2601	Valid loss: 0.5448	Train accuracy: 91.75	Valid accuracy: 83.72
18:41:14 --- Epoch: 165	Train loss: 0.2557	Valid loss: 0.5388	Train accuracy: 91.66	Valid accuracy: 83.76
18:42:10 --- Epoch: 166	Train loss: 0.2615	Valid loss: 0.5403	Train accuracy: 91.90	Valid accuracy: 83.66
18:43:05 --- Epoch: 167	Train loss: 0.2579	Valid loss: 0.5462	Train accuracy: 91.94	Valid accuracy: 83.81
18:44:00 --- Epoch: 168	Train loss: 0.2565	Valid loss: 0.5423	Train accuracy: 91.74	Valid accuracy: 83.70
18:44:55 --- Epoch: 169	Train loss: 0.2580	Valid loss: 0.5413	Train accuracy: 91.63	Valid accuracy: 83.83
18:45:51 --- Epoch: 170	Train loss: 0.2616	Valid loss: 0.5393	Train accuracy: 91.86	Valid accuracy: 83.71
18:46:46 --- Epoch: 171	Train loss: 0.2598	Valid loss: 0.5400	Train accuracy: 91.74	Valid accuracy: 83.66
18:47:41 --- Epoch: 172	Train loss: 0.2599	Valid loss: 0.5361	Train accuracy: 91.61	Valid accuracy: 83.76
18:48:41 --- Epoch: 173	Train loss: 0.2585	Valid loss: 0.5463	Train accuracy: 91.54	Valid accuracy: 83.63
18:49:36 --- Epoch: 174	Train loss: 0.2566	Valid loss: 0.5390	Train accuracy: 91.76	Valid accuracy: 83.72
18:50:31 --- Epoch: 175	Train loss: 0.2590	Valid loss: 0.5427	Train accuracy: 91.66	Valid accuracy: 83.67
18:51:26 --- Epoch: 176	Train loss: 0.2592	Valid loss: 0.5402	Train accuracy: 91.84	Valid accuracy: 83.76
18:52:22 --- Epoch: 177	Train loss: 0.2562	Valid loss: 0.5443	Train accuracy: 91.78	Valid accuracy: 83.63
18:53:18 --- Epoch: 178	Train loss: 0.2613	Valid loss: 0.5397	Train accuracy: 91.68	Valid accuracy: 83.68
18:54:15 --- Epoch: 179	Train loss: 0.2549	Valid loss: 0.5438	Train accuracy: 91.79	Valid accuracy: 83.56
18:55:10 --- Epoch: 180	Train loss: 0.2609	Valid loss: 0.5375	Train accuracy: 91.71	Valid accuracy: 83.82
18:56:06 --- Epoch: 181	Train loss: 0.2578	Valid loss: 0.5369	Train accuracy: 91.73	Valid accuracy: 83.78
18:57:04 --- Epoch: 182	Train loss: 0.2599	Valid loss: 0.5419	Train accuracy: 91.81	Valid accuracy: 83.87
18:58:00 --- Epoch: 183	Train loss: 0.2578	Valid loss: 0.5407	Train accuracy: 91.71	Valid accuracy: 83.72
18:58:56 --- Epoch: 184	Train loss: 0.2581	Valid loss: 0.5438	Train accuracy: 91.80	Valid accuracy: 83.79
18:59:51 --- Epoch: 185	Train loss: 0.2594	Valid loss: 0.5509	Train accuracy: 91.67	Valid accuracy: 83.61
19:00:47 --- Epoch: 186	Train loss: 0.2575	Valid loss: 0.5399	Train accuracy: 91.61	Valid accuracy: 83.80
19:01:44 --- Epoch: 187	Train loss: 0.2554	Valid loss: 0.5407	Train accuracy: 92.02	Valid accuracy: 83.76
19:02:39 --- Epoch: 188	Train loss: 0.2621	Valid loss: 0.5440	Train accuracy: 91.82	Valid accuracy: 83.77
19:03:35 --- Epoch: 189	Train loss: 0.2605	Valid loss: 0.5441	Train accuracy: 91.96	Valid accuracy: 83.72
19:04:31 --- Epoch: 190	Train loss: 0.2561	Valid loss: 0.5419	Train accuracy: 91.90	Valid accuracy: 83.67
19:05:29 --- Epoch: 191	Train loss: 0.2550	Valid loss: 0.5413	Train accuracy: 91.96	Valid accuracy: 83.62
19:06:26 --- Epoch: 192	Train loss: 0.2567	Valid loss: 0.5448	Train accuracy: 91.79	Valid accuracy: 83.73
19:07:24 --- Epoch: 193	Train loss: 0.2551	Valid loss: 0.5458	Train accuracy: 91.79	Valid accuracy: 83.82
19:08:21 --- Epoch: 194	Train loss: 0.2586	Valid loss: 0.5462	Train accuracy: 91.80	Valid accuracy: 83.66
19:09:19 --- Epoch: 195	Train loss: 0.2572	Valid loss: 0.5414	Train accuracy: 91.80	Valid accuracy: 83.71
19:10:22 --- Epoch: 196	Train loss: 0.2562	Valid loss: 0.5517	Train accuracy: 91.76	Valid accuracy: 83.65
19:11:19 --- Epoch: 197	Train loss: 0.2561	Valid loss: 0.5424	Train accuracy: 91.67	Valid accuracy: 83.72
19:12:14 --- Epoch: 198	Train loss: 0.2577	Valid loss: 0.5446	Train accuracy: 91.70	Valid accuracy: 83.72
19:13:10 --- Epoch: 199	Train loss: 0.2536	Valid loss: 0.5468	Train accuracy: 91.75	Valid accuracy: 83.68
19:14:05 --- Epoch: 200	Train loss: 0.2554	Valid loss: 0.5400	Train accuracy: 91.81	Valid accuracy: 83.83
19:14:12 --- 当前时间戳为: 1648293245	top1 acc: 0.8383	top5 acc: 0.9931