----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           3,136
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]          36,864
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-10             [-1, 64, 1, 1]               0
           Linear-11                    [-1, 4]             256
             ReLU-12                    [-1, 4]               0
           Linear-13                   [-1, 64]             256
          Sigmoid-14                   [-1, 64]               0
          SEBlock-15           [-1, 64, 56, 56]               0
             ReLU-16           [-1, 64, 56, 56]               0
     SEBasicBlock-17           [-1, 64, 56, 56]               0
           Conv2d-18           [-1, 64, 56, 56]          36,864
      BatchNorm2d-19           [-1, 64, 56, 56]             128
             ReLU-20           [-1, 64, 56, 56]               0
           Conv2d-21           [-1, 64, 56, 56]          36,864
      BatchNorm2d-22           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-23             [-1, 64, 1, 1]               0
           Linear-24                    [-1, 4]             256
             ReLU-25                    [-1, 4]               0
           Linear-26                   [-1, 64]             256
          Sigmoid-27                   [-1, 64]               0
          SEBlock-28           [-1, 64, 56, 56]               0
             ReLU-29           [-1, 64, 56, 56]               0
     SEBasicBlock-30           [-1, 64, 56, 56]               0
           Conv2d-31          [-1, 128, 28, 28]          73,728
      BatchNorm2d-32          [-1, 128, 28, 28]             256
             ReLU-33          [-1, 128, 28, 28]               0
           Conv2d-34          [-1, 128, 28, 28]         147,456
      BatchNorm2d-35          [-1, 128, 28, 28]             256
AdaptiveAvgPool2d-36            [-1, 128, 1, 1]               0
           Linear-37                    [-1, 8]           1,024
             ReLU-38                    [-1, 8]               0
           Linear-39                  [-1, 128]           1,024
          Sigmoid-40                  [-1, 128]               0
          SEBlock-41          [-1, 128, 28, 28]               0
           Conv2d-42          [-1, 128, 28, 28]           8,192
      BatchNorm2d-43          [-1, 128, 28, 28]             256
             ReLU-44          [-1, 128, 28, 28]               0
     SEBasicBlock-45          [-1, 128, 28, 28]               0
           Conv2d-46          [-1, 128, 28, 28]         147,456
      BatchNorm2d-47          [-1, 128, 28, 28]             256
             ReLU-48          [-1, 128, 28, 28]               0
           Conv2d-49          [-1, 128, 28, 28]         147,456
      BatchNorm2d-50          [-1, 128, 28, 28]             256
AdaptiveAvgPool2d-51            [-1, 128, 1, 1]               0
           Linear-52                    [-1, 8]           1,024
             ReLU-53                    [-1, 8]               0
           Linear-54                  [-1, 128]           1,024
          Sigmoid-55                  [-1, 128]               0
          SEBlock-56          [-1, 128, 28, 28]               0
             ReLU-57          [-1, 128, 28, 28]               0
     SEBasicBlock-58          [-1, 128, 28, 28]               0
           Conv2d-59          [-1, 256, 14, 14]         294,912
      BatchNorm2d-60          [-1, 256, 14, 14]             512
             ReLU-61          [-1, 256, 14, 14]               0
           Conv2d-62          [-1, 256, 14, 14]         589,824
      BatchNorm2d-63          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-64            [-1, 256, 1, 1]               0
           Linear-65                   [-1, 16]           4,096
             ReLU-66                   [-1, 16]               0
           Linear-67                  [-1, 256]           4,096
          Sigmoid-68                  [-1, 256]               0
          SEBlock-69          [-1, 256, 14, 14]               0
           Conv2d-70          [-1, 256, 14, 14]          32,768
      BatchNorm2d-71          [-1, 256, 14, 14]             512
             ReLU-72          [-1, 256, 14, 14]               0
     SEBasicBlock-73          [-1, 256, 14, 14]               0
           Conv2d-74          [-1, 256, 14, 14]         589,824
      BatchNorm2d-75          [-1, 256, 14, 14]             512
             ReLU-76          [-1, 256, 14, 14]               0
           Conv2d-77          [-1, 256, 14, 14]         589,824
      BatchNorm2d-78          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-79            [-1, 256, 1, 1]               0
           Linear-80                   [-1, 16]           4,096
             ReLU-81                   [-1, 16]               0
           Linear-82                  [-1, 256]           4,096
          Sigmoid-83                  [-1, 256]               0
          SEBlock-84          [-1, 256, 14, 14]               0
             ReLU-85          [-1, 256, 14, 14]               0
     SEBasicBlock-86          [-1, 256, 14, 14]               0
           Conv2d-87            [-1, 512, 7, 7]       1,179,648
      BatchNorm2d-88            [-1, 512, 7, 7]           1,024
             ReLU-89            [-1, 512, 7, 7]               0
           Conv2d-90            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-91            [-1, 512, 7, 7]           1,024
AdaptiveAvgPool2d-92            [-1, 512, 1, 1]               0
           Linear-93                   [-1, 32]          16,384
             ReLU-94                   [-1, 32]               0
           Linear-95                  [-1, 512]          16,384
          Sigmoid-96                  [-1, 512]               0
          SEBlock-97            [-1, 512, 7, 7]               0
           Conv2d-98            [-1, 512, 7, 7]         131,072
      BatchNorm2d-99            [-1, 512, 7, 7]           1,024
            ReLU-100            [-1, 512, 7, 7]               0
    SEBasicBlock-101            [-1, 512, 7, 7]               0
          Conv2d-102            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-103            [-1, 512, 7, 7]           1,024
            ReLU-104            [-1, 512, 7, 7]               0
          Conv2d-105            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-106            [-1, 512, 7, 7]           1,024
AdaptiveAvgPool2d-107            [-1, 512, 1, 1]               0
          Linear-108                   [-1, 32]          16,384
            ReLU-109                   [-1, 32]               0
          Linear-110                  [-1, 512]          16,384
         Sigmoid-111                  [-1, 512]               0
         SEBlock-112            [-1, 512, 7, 7]               0
            ReLU-113            [-1, 512, 7, 7]               0
    SEBasicBlock-114            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-115            [-1, 512, 1, 1]               0
          Linear-116                 [-1, 1000]         513,000
================================================================
Total params: 11,770,280
Trainable params: 11,770,280
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 68.58
Params size (MB): 44.90
Estimated Total Size (MB): 113.67
----------------------------------------------------------------
#Params: 11.8M
14:19:48 --- Start training loop	training on: cuda
14:20:56 --- Epoch: 1	Train loss: 0.3313	Valid loss: 0.1183	Train accuracy: 95.94	Valid accuracy: 96.05
14:21:58 --- Epoch: 2	Train loss: 0.1011	Valid loss: 0.0834	Train accuracy: 97.11	Valid accuracy: 97.33
14:22:59 --- Epoch: 3	Train loss: 0.0786	Valid loss: 0.0800	Train accuracy: 97.73	Valid accuracy: 97.58
14:24:01 --- Epoch: 4	Train loss: 0.0661	Valid loss: 0.0575	Train accuracy: 98.10	Valid accuracy: 98.20
14:25:05 --- Epoch: 5	Train loss: 0.0586	Valid loss: 0.0670	Train accuracy: 98.14	Valid accuracy: 97.91
14:26:08 --- Epoch: 6	Train loss: 0.0526	Valid loss: 0.0678	Train accuracy: 98.50	Valid accuracy: 97.83
14:27:09 --- Epoch: 7	Train loss: 0.0494	Valid loss: 0.0556	Train accuracy: 98.43	Valid accuracy: 98.23
14:28:11 --- Epoch: 8	Train loss: 0.0458	Valid loss: 0.0583	Train accuracy: 98.53	Valid accuracy: 98.22
14:29:13 --- Epoch: 9	Train loss: 0.0431	Valid loss: 0.0512	Train accuracy: 98.69	Valid accuracy: 98.30
14:30:16 --- Epoch: 10	Train loss: 0.0395	Valid loss: 0.0464	Train accuracy: 98.81	Valid accuracy: 98.51
14:31:18 --- Epoch: 11	Train loss: 0.0379	Valid loss: 0.0552	Train accuracy: 98.80	Valid accuracy: 98.29
14:32:19 --- Epoch: 12	Train loss: 0.0358	Valid loss: 0.0541	Train accuracy: 98.77	Valid accuracy: 98.36
14:33:20 --- Epoch: 13	Train loss: 0.0352	Valid loss: 0.0484	Train accuracy: 98.93	Valid accuracy: 98.51
14:34:22 --- Epoch: 14	Train loss: 0.0329	Valid loss: 0.0483	Train accuracy: 98.96	Valid accuracy: 98.49
14:35:22 --- Epoch: 15	Train loss: 0.0295	Valid loss: 0.0425	Train accuracy: 99.04	Valid accuracy: 98.67
14:35:25 --- Time Stamp: 1651040388	top1 error: 0.0133	top5 error: 0.0000